def transformSig(signal): # ทำการแปลงสัญญาณให้เป็นแบบสัญญาณต่อเนื่อง
#ถ้าเป็นสัญญาณซื้อก็จะซื้อยาวไปเรื่อยๆจนกว่าจะขาย
    rows = len(signal)  
    signal[0] = -1 # กำหนดให้สัญญาณซื้อขายวันแรกหรือวันที่ 0 เป็น -1 ก็คือเริ่มต้นไม่มีการซื้อเกิดขึ้นในวันแรก
    for i in range(1,rows): # วนลูปโดยพิจารณาทีละแถวว่า สัญญาณเป็น 0 ก็คือวันนั้นไม่มีสัญญาณ ให้ signal วันนั้นเท่ากับของวันก่อนหน้านั้น
        # และเมื่อวันนั้นมีสัญญาณอื่นเกิดขึ้น หรือว่าเป็นสัญญาณซื้อก็จะไม่ทำอะไร ดังนั้นสัญญาณต่อๆไปก็จะเป็นแบบสัญญาณซื้อเพราะอ้างของวันก่อนหน้า
        if signal[i] == 0:
            signal[i] = signal[i-1];    
    return signal
